# BuiltInFailures.StructuralLoadFailures Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuiltInFailures..::..StructuralLoadFailures Members
BuiltInFailures..::..StructuralLoadFailures Class Properties See Also
---
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures..::..StructuralLoadFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CannotMirrorBoundaryCondition | Can't mirror Boundary Conditions |
| CannotMoveBoundaryCondition | Can't move Boundary Conditions |
| CannotPlaceBoundaryConditions | A boundary condition is already created on the selected element. Duplicate boundary conditions are not allowed. Click the Replace button to delete previous definition of boundary condition or cancel the operation. |
| HostChangeDisallowsLoadOrBoundaryConditions | Some Hosted Loads or BoundaryConditions lost their References. They will be deleted. |

# See Also
BuiltInFailures..::..StructuralLoadFailures Class
Autodesk.Revit.DB Namespace